src/cf/Documents/НачислениеЗаПокупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НачислениеЗаПокупки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Бонусы</xr:Item>
				<xr:Item>AccumulationRegister.Платежи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Покупки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Покупка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бонусы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/Платежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Платежи</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Возврат</v8:Type>
						<v8:Type>cfg:DocumentRef.Покупка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/НачислениеЗаПокупки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьПокупкамиНаСервере()
	
	Объект.Покупки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.ДатаОстатков);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежиОстатки.Контрагент КАК Контрагент,
		|	ПлатежиОстатки.Основание КАК Основание,
		|	ПлатежиОстатки.СуммаОстаток КАК Сумма
		|ПОМЕСТИТЬ втСуммы
		|ИЗ
		|	РегистрНакопления.Платежи.Остатки(&Дата) КАК ПлатежиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втСуммы.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ втКонтрагенты
		|ИЗ
		|	втСуммы КАК втСуммы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКонтрагенты.Контрагент КАК Контрагент,
		|	Контрагенты.Процент КАК Процент
		|ПОМЕСТИТЬ втПроценты
		|ИЗ
		|	втКонтрагенты КАК втКонтрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО втКонтрагенты.Контрагент = Контрагенты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСуммы.Контрагент КАК Контрагент,
		|	втСуммы.Основание КАК Основание,
		|	втСуммы.Сумма КАК Сумма,
		|	втПроценты.Процент КАК Процент,
		|	ВЫРАЗИТЬ(втСуммы.Сумма * втПроценты.Процент / 100 КАК ЧИСЛО(12, 2)) КАК Бонусы
		|ИЗ
		|	втСуммы КАК втСуммы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПроценты КАК втПроценты
		|		ПО втСуммы.Контрагент = втПроценты.Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Покупки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПокупками(Команда)
	ЗаполнитьПокупкамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьПериод()
	КоличествоДнейДоНачисления = НастройкиСерверПовтИсп.ПолучитьКоличествоДнейДоНачисления(Объект.Дата);
	Объект.ДатаОстатков = НачалоДня(Объект.Дата) - КоличествоДнейДоНачисления * 86400;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПериод();
КонецПроцедуры
